#specify directory to install stuff
cask_args appdir: "/Applications"
# install the packages
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
cask "alfred"
cask "docker"
cask "firefox"
cask "flux"
cask "dash"
cask "calibre"
cask "google-chrome"
cask "opera"
cask "brave-browser"
cask "iterm2"
cask "slack"
cask "visual-studio-code"
cask "gpg-suite"
cask "keybase"
cask "postman"
cask "appcleaner"
cask "vlc"
cask "ngrok"
cask "zoom"
cask "google-backup-and-sync"
cask "homebrew/fonts/font-open-sans"
cask "homebrew/fonts/font-roboto"
cask "homebrew/fonts/font-hack"
cask "homebrew/fonts/font-roboto-mono"
cask "homebrew/fonts/font-source-code-pro"
cask "obsidian"
cask "sidenotes"
cask "aerial"
cask "macfuse"
cask "raspberry-pi-imager"
cask "notion"
cask "foldingtext"
mas "Xcode", id: 497799835
mas "Amphetamine", id: 937984704
brew "bdw-gc"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "coreutils"
brew "emacs"
brew "fd"
brew "gdbm"
brew "gettext"
brew "gmp"
brew "gnutls"
brew "go"
brew "guile"
brew "icu4c"
brew "jansson"
brew "libevent"
brew "libffi"
brew "libidn2"
brew "liblinear"
brew "libnghttp2"
brew "libssh2"
brew "libtasn1"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libzip"
brew "lua@5.3"
brew "m4"
brew "mpdecimal"
brew "ncurses"
brew "nettle"
brew "node"
brew "oniguruma"
brew "openssl@1.1"
brew "openssl@3"
brew "p11-kit"
brew "pcre"
brew "pkg-config"
brew "python@3.10"
brew "python@3.9"
brew "readline"
brew "speedtest-cli"
brew "sqlite"
brew "sslscan"
brew "task"
brew "tfsec"
brew "tldr"
brew "tmux"
brew "tree"
brew "trivy"
brew "unbound"
brew "utf8proc"
brew "wget"
brew "wifi-password"
brew "xz"
brew "zstd"
brew "awscli"
brew "jq"
brew "languagetool"
brew "gh"
brew "nmap"
brew "openssl"
brew "watch"
brew "docker-compose"
brew "git-lfs"
brew "act"
brew "mtr"
brew "thefuck"
brew "htop"
brew "hstr"
brew "git-extras"
brew "wget"
brew "wireshark", link: false
brew "vault"
brew "massren"
brew "terraform"
brew "nvm"
brew "python3"
brew "java"
